---
kind: enumMember
id: F:Autodesk.Revit.DB.VirtualPrinterType.XPSWriter
enum: Autodesk.Revit.DB.VirtualPrinterType
source: html/1dbef4a3-3f51-91ad-5a9e-04c36be1c5ca.htm
---
# Autodesk.Revit.DB.VirtualPrinterType.XPSWriter

Microsoft XPS Document Writer.